const random_hex_color_code = () => {
    let n = (Math.random() * 0xfffff * 1000000).toString(16);
     return '#' + n.slice(0, 6);
};

console.log(random_hex_color_code())


/* 
?อธิบายโค้ด:
    *1.Math.random():
    *   ฟังก์ชันนี้จะคืนค่าเลขทศนิยมสุ่มระหว่าง 0 ถึง 1 ดังนั้นจึงใช้ในการสร้างเลขสุ่ม

    *2.การคูณด้วย 0xfffff * 1000000:
    *   0xfffff เป็นเลขฐานสิบหกที่แปลงเป็นฐานสิบคือ 1048575 การคูณด้วยตัวเลขนี้เป็นการเพิ่มช่วงของค่าที่ได้จาก Math.random() เพื่อให้ครอบคลุมความยาวที่ต้องการสำหรับรหัสสีแบบสุ่ม (6 ตัวอักษร)

    *การคูณด้วย 1000000 เพื่อให้แน่ใจว่ามีเลขจำนวนเต็มที่มีหลักมากพอที่จะสร้างรหัสสีแบบฐานสิบหกที่มี 6 ตัวอักษร

    *3.toString(16):
    *   ฟังก์ชัน toString(16) ใช้ในการแปลงเลขฐานสิบเป็นสตริงในรูปแบบฐานสิบหก (Hexadecimal) ซึ่งจะได้ตัวอักษรตั้งแต่ 0-9 และ a-f

    *4.slice(0, 6):
    *   ฟังก์ชัน slice() ใช้ในการตัดสตริงเพื่อเอาเฉพาะ 6 ตัวอักษรแรกเท่านั้น (เนื่องจากรหัสสีในระบบ Hexadecimal ประกอบด้วย 6 ตัวอักษร)

    *5.return '#' + n.slice(0, 6):
    *   สุดท้าย ฟังก์ชันจะคืนค่าสตริงที่ประกอบด้วยสัญลักษณ์ # ตามด้วยรหัสสีที่ได้จากการแปลงด้านบน ซึ่งเป็นรูปแบบของรหัสสีใน HTML เช่น #a3f1e2
 */