const digitize = n => [...`${Math.abs(n)}`].map(i => parseInt(i));

console.log(digitize(123456789));


/*
 ?อธิบายโค้ด:
    * 1.Math.abs(n):
        *ฟังก์ชัน Math.abs() ใช้เพื่อคืนค่าสัมบูรณ์ของตัวเลข n หมายความว่าถ้าตัวเลขเป็นลบ มันจะถูกแปลงเป็นบวก ซึ่งในโจทย์นี้ต้องการให้มั่นใจว่าทุกตัวเลขที่นำมาใช้จะเป็นบวกเสมอ (เพื่อให้ไม่มีเครื่องหมายลบในการแปลงเป็นสตริง)

    * 2.สเปรดโอเปอเรเตอร์ [... ]:
        *สเปรดโอเปอเรเตอร์ใช้สำหรับกระจายหรือแยกสตริงตัวเลขเป็นตัวอักษรเดี่ยว ๆ แล้วสร้างเป็นอาร์เรย์ เช่น ถ้า n = 123 สเปรดโอเปอเรเตอร์จะเปลี่ยนให้เป็นอาร์เรย์ ['1', '2', '3']

    * 3.Array.prototype.map():
        *ฟังก์ชัน map() จะทำการวนลูปผ่านแต่ละค่าในอาร์เรย์ (ที่ได้จากสเปรดโอเปอเรเตอร์) แล้วใช้ฟังก์ชัน parseInt() ในการแปลงแต่ละค่าจากสตริงให้เป็นตัวเลข (Integer) เช่น '1' จะถูกแปลงเป็น 1 ซึ่งจะได้ผลลัพธ์เป็นอาร์เรย์ [1, 2, 3]
 */
